Documents/ЗаданиеНаДоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаданиеНаДоставку</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаданиеНаДоставку</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаДоставке</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавленыДанныеИзДругогоЗаданияНаДоставку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьКорректировкиГрузомест</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КроссДокинг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаказаВУТ11</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерWMS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доставка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДоставки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументСборки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаВозврат</v8:Type>
								<v8:Type>cfg:DocumentRef.ОбъединениеГМВТЕ</v8:Type>
								<v8:Type>cfg:DocumentRef.СлужебнаяЗаписка</v8:Type>
								<v8:Type>cfg:DocumentRef.СборкаЗаказовПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Возврат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Деньги</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоставкаПоказная</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДоставки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Возврат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Деньги</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОчередьДоставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОчередьДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Маршруты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МаршрутыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Возвраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДоставки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументСборки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаНаВозврат</v8:Type>
								<v8:Type>cfg:DocumentRef.СлужебнаяЗаписка</v8:Type>
								<v8:Type>cfg:DocumentRef.СборкаЗаказовПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Возврат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОчередьПечатиККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОчередьПечатиККМ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекВодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекЗадание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекРеализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Деньги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаПостановкиВОчередь</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументЧек</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаданиеНаДоставку/Ext/ManagerModule.bsl
Процедура СформироватьОтчетОВыполнении(ДокСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ОчередьПечатиККМ.ТекСумма) КАК ТекСумма,
	|	ОчередьПечатиККМ.ТекРеализация,
	|	ОчередьПечатиККМ.ТекКонтрагент
	|ПОМЕСТИТЬ СуммыПКО
	|ИЗ
	|	РегистрСведений.ОчередьПечатиККМ КАК ОчередьПечатиККМ
	|ГДЕ
	|	ОчередьПечатиККМ.ДокументЧек <> ЗНАЧЕНИЕ(Документ.ПриходныйКассовыйОрдер.ПустаяСсылка)
	|	И ОчередьПечатиККМ.ТекЗадание = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОчередьПечатиККМ.ТекРеализация,
	|	ОчередьПечатиККМ.ТекКонтрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОчередьПечатиККМ.ДокументЧек,
	|	ОчередьПечатиККМ.ТекРеализация
	|ПОМЕСТИТЬ НеПроведенныеПКО
	|ИЗ
	|	РегистрСведений.ОчередьПечатиККМ КАК ОчередьПечатиККМ
	|ГДЕ
	|	ОчередьПечатиККМ.ДокументЧек <> ЗНАЧЕНИЕ(Документ.ПриходныйКассовыйОрдер.ПустаяСсылка)
	|	И ОчередьПечатиККМ.ТекЗадание = &Ссылка
	|	И НЕ ОчередьПечатиККМ.ДокументЧек.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ОчередьПечатиККМ.ДокументЧек,
	|	ОчередьПечатиККМ.ТекРеализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданиеНаДоставку.Дата,
	|	ЗаданиеНаДоставку.Номер,
	|	ЗаданиеНаДоставку.Маршрут,
	|	ЗаданиеНаДоставку.Водитель,
	|	СУММА(ВЫБОР
	|			КОГДА ОчередьПечатиККМ.ДокументЧек.Организация = КонстОснОрганизация.ОсновнаяОрганизация
	|				ТОГДА ЕСТЬNULL(ОчередьПечатиККМ.ТекСумма, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПКО,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ОчередьПечатиККМ.ДокументЧек.Организация = КонстОснОрганизация.ОсновнаяОрганизация
	|				ТОГДА ЕСТЬNULL(ОчередьПечатиККМ.ТекСумма, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПКОУпр
	|ИЗ
	|	Документ.ЗаданиеНаДоставку КАК ЗаданиеНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОчередьПечатиККМ КАК ОчередьПечатиККМ
	|		ПО (ОчередьПечатиККМ.ТекЗадание = ЗаданиеНаДоставку.Ссылка)
	|			И (ОчередьПечатиККМ.ДокументЧек <> ЗНАЧЕНИЕ(Документ.ПриходныйКассовыйОрдер.ПустаяСсылка)),
	|	(ВЫБРАТЬ
	|		Константы.ОсновнаяОрганизация КАК ОсновнаяОрганизация
	|	ИЗ
	|		Константы КАК Константы) КАК КонстОснОрганизация
	|ГДЕ
	|	ЗаданиеНаДоставку.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданиеНаДоставку.Дата,
	|	ЗаданиеНаДоставку.Номер,
	|	ЗаданиеНаДоставку.Маршрут,
	|	ЗаданиеНаДоставку.Водитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданиеНаДоставкуДоставка.Контрагент КАК Грузополучатель,
	|	СУММА(ЗаданиеНаДоставкуДоставка.Количество) КАК КоличествоМест,
	|	ВЫБОР
	|		КОГДА ЗаданиеНаДоставкуДоставка.Возврат = ИСТИНА
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Возврат,
	|	ЕСТЬNULL(ЗаданиеНаДоставкуДоставка.ДокументСборки.Договор.ОплатаПоДоговоруНаличными, ЛОЖЬ) КАК ПриемДенег,
	|	ЗаданиеНаДоставкуДоставка.Маршрут КАК Маршрут,
	|	Контрагенты.ПриоритетВМаршруте КАК ПриоритетВМаршруте,
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка,
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Номер КАК Номер,
	|	МИНИМУМ(ЗаданиеНаДоставкуДоставка.НомерСтроки) КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка ЕСТЬ NULL
	|				И ЗаданиеНаДоставкуДоставка.Отменено
	|			ТОГДА ""Перенос доставки""
	|		ИНАЧЕ ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, """")
	|	КОНЕЦ КАК СтатусДоставки,
	|	ЕСТЬNULL(ЗначениеВремениПередачи.Значение, """") КАК ВремяПередачи,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СуммыПКО.ТекРеализация.Организация = КонстОснОрганизация.ОсновнаяОрганизация
	|				ТОГДА ЕСТЬNULL(СуммыПКО.ТекСумма, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПКО,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ СуммыПКО.ТекРеализация.Организация = КонстОснОрганизация.ОсновнаяОрганизация
	|				ТОГДА ЕСТЬNULL(СуммыПКО.ТекСумма, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПКОУпр,
	|	НеПроведенныеПКО.ДокументЧек КАК ДокументЧек,
	|	ЕСТЬNULL(РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.СуммаДокумента, 0) КАК СуммаРеализации,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА АдресДоставки.Объект ЕСТЬ NULL
	|				ТОГДА """"
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПОДСТРОКА(АдресДоставки.Поле4, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле6, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле7, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	|						ТОГДА АдресДоставки.Представление
	|					ИНАЧЕ АдресДоставки.Поле2 + "", "" + АдресДоставки.Поле3 + АдресДоставки.Поле4 + "" "" + АдресДоставки.Поле5 + "", "" + АдресДоставки.Поле6 + "", дом № "" + АдресДоставки.Поле7 + "" "" + ВЫБОР
	|							КОГДА ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	|								ТОГДА """"
	|							ИНАЧЕ "" корпус "" + АдресДоставки.Поле8
	|						КОНЕЦ + "" "" + ВЫБОР
	|							КОГДА ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	|								ТОГДА """"
	|							ИНАЧЕ "" оф."" + АдресДоставки.Поле9
	|						КОНЕЦ + """"
	|				КОНЕЦ
	|		КОНЕЦ КАК СТРОКА(250)) КАК АдресДоставки,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТелефонКонтрагента.Объект ЕСТЬ NULL
	|				ТОГДА """"
	|			ИНАЧЕ ТелефонКонтрагента.Представление
	|		КОНЕЦ КАК СТРОКА(100)) КАК Тел,
	|	ВЫБОР
	|		КОГДА КатегорииОбъектов.Объект ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ""ДА""
	|	КОНЕЦ КАК Доверенность,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Организация = КонстОснОрганизация.ОсновнаяОрганизация
	|				И НЕ РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.ДоговорКонтрагента.РозничнаяПродажа
	|				И НЕ РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.ДоговорКонтрагента.ЛицевойСчет
	|				И НЕ РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.ДоговорКонтрагента.Владелец.СтатусФНСКонтрагента = ЗНАЧЕНИЕ(Справочник.СтатусыФНСКонтрагента.КонтрагентЕстьВБазеФНС)
	|			ТОГДА РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.ДоговорКонтрагента.Владелец.СтатусФНСКонтрагента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СтатусФНС
	|ИЗ
	|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ЗаданиеНаДоставкуДоставка.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресДоставки
	|		ПО (АдресДоставки.Объект = Контрагенты.Ссылка)
	|			И (АдресДоставки.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (АдресДоставки.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ТелефонКонтрагента
	|		ПО (ТелефонКонтрагента.Объект = Контрагенты.Ссылка)
	|			И (ТелефонКонтрагента.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|			И (ТелефонКонтрагента.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ЗначенияСвойствОбъектов.Объект КАК Объект,
	|				ЗначенияСвойствОбъектов.Значение КАК Значение
	|			ИЗ
	|				РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|			ГДЕ
	|				ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусДоставки)) КАК ЗначенияСвойствОбъектов
	|			ПО РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка = ЗначенияСвойствОбъектов.Объект
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ЗначенияСвойствОбъектов.Объект КАК Объект,
	|				ЗначенияСвойствОбъектов.Значение КАК Значение
	|			ИЗ
	|				РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|			ГДЕ
	|				ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.ВремяПередачи)) КАК ЗначениеВремениПередачи
	|			ПО РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка = ЗначениеВремениПередачи.Объект
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|			ПО РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка = КатегорииОбъектов.Объект
	|				И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.НетАктуальнойДоверенности))
	|		ПО ЗаданиеНаДоставкуДоставка.ДокументСборки = РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки
	|			И (РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Проведен)
	|			И (НЕ ЗаданиеНаДоставкуДоставка.Отменено)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммыПКО КАК СуммыПКО
	|		ПО (РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка = СуммыПКО.ТекРеализация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НеПроведенныеПКО КАК НеПроведенныеПКО
	|		ПО (РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка = НеПроведенныеПКО.ТекРеализация),
	|	(ВЫБРАТЬ
	|		Константы.ОсновнаяОрганизация КАК ОсновнаяОрганизация
	|	ИЗ
	|		Константы КАК Константы) КАК КонстОснОрганизация
	|ГДЕ
	|	ЗаданиеНаДоставкуДоставка.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданиеНаДоставкуДоставка.Контрагент,
	|	Контрагенты.ПриоритетВМаршруте,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТелефонКонтрагента.Объект ЕСТЬ NULL
	|				ТОГДА """"
	|			ИНАЧЕ ТелефонКонтрагента.Представление
	|		КОНЕЦ КАК СТРОКА(100)),
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка,
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Номер,
	|	ЕСТЬNULL(ЗаданиеНаДоставкуДоставка.ДокументСборки.Договор.ОплатаПоДоговоруНаличными, ЛОЖЬ),
	|	ВЫБОР
	|		КОГДА ЗаданиеНаДоставкуДоставка.Возврат = ИСТИНА
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ЗаданиеНаДоставкуДоставка.Маршрут,
	|	ЕСТЬNULL(ЗначениеВремениПередачи.Значение, """"),
	|	НеПроведенныеПКО.ДокументЧек,
	|	ЕСТЬNULL(РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.СуммаДокумента, 0),
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА АдресДоставки.Объект ЕСТЬ NULL
	|				ТОГДА """"
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПОДСТРОКА(АдресДоставки.Поле4, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле6, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле7, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	|						ТОГДА АдресДоставки.Представление
	|					ИНАЧЕ АдресДоставки.Поле2 + "", "" + АдресДоставки.Поле3 + АдресДоставки.Поле4 + "" "" + АдресДоставки.Поле5 + "", "" + АдресДоставки.Поле6 + "", дом № "" + АдресДоставки.Поле7 + "" "" + ВЫБОР
	|							КОГДА ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	|								ТОГДА """"
	|							ИНАЧЕ "" корпус "" + АдресДоставки.Поле8
	|						КОНЕЦ + "" "" + ВЫБОР
	|							КОГДА ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	|								ТОГДА """"
	|							ИНАЧЕ "" оф."" + АдресДоставки.Поле9
	|						КОНЕЦ + """"
	|				КОНЕЦ
	|		КОНЕЦ КАК СТРОКА(250)),
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка ЕСТЬ NULL
	|				И ЗаданиеНаДоставкуДоставка.Отменено
	|			ТОГДА ""Перенос доставки""
	|		ИНАЧЕ ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, """")
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КатегорииОбъектов.Объект ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ""ДА""
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Организация = КонстОснОрганизация.ОсновнаяОрганизация
	|				И НЕ РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.ДоговорКонтрагента.РозничнаяПродажа
	|				И НЕ РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.ДоговорКонтрагента.ЛицевойСчет
	|				И НЕ РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.ДоговорКонтрагента.Владелец.СтатусФНСКонтрагента = ЗНАЧЕНИЕ(Справочник.СтатусыФНСКонтрагента.КонтрагентЕстьВБазеФНС)
	|			ТОГДА РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.ДоговорКонтрагента.Владелец.СтатусФНСКонтрагента
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаданиеНаДоставкуДоставкаПоказная.Контрагент,
	|	0,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	МИНИМУМ(999),
	|	NULL,
	|	NULL,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СуммыПКО.ТекРеализация.Организация = КонстОснОрганизация.ОсновнаяОрганизация
	|				ТОГДА ЕСТЬNULL(СуммыПКО.ТекСумма, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ СуммыПКО.ТекРеализация.Организация = КонстОснОрганизация.ОсновнаяОрганизация
	|				ТОГДА ЕСТЬNULL(СуммыПКО.ТекСумма, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	NULL,
	|	0,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА АдресДоставки.Объект ЕСТЬ NULL
	|				ТОГДА """"
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПОДСТРОКА(АдресДоставки.Поле4, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле6, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле7, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	|						ТОГДА АдресДоставки.Представление
	|					ИНАЧЕ АдресДоставки.Поле4 + "" "" + АдресДоставки.Поле5 + "", "" + АдресДоставки.Поле6 + "", дом № "" + АдресДоставки.Поле7 + "" "" + ВЫБОР
	|							КОГДА ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	|								ТОГДА """"
	|							ИНАЧЕ "" корпус "" + АдресДоставки.Поле8
	|						КОНЕЦ + "" "" + ВЫБОР
	|							КОГДА ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	|								ТОГДА """"
	|							ИНАЧЕ "" оф."" + АдресДоставки.Поле9
	|						КОНЕЦ + """"
	|				КОНЕЦ
	|		КОНЕЦ КАК СТРОКА(999)),
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТелефонКонтрагента.Объект ЕСТЬ NULL
	|				ТОГДА """"
	|			ИНАЧЕ ТелефонКонтрагента.Представление
	|		КОНЕЦ КАК СТРОКА(100)),
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.ЗаданиеНаДоставку.ДоставкаПоказная КАК ЗаданиеНаДоставкуДоставкаПоказная
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммыПКО КАК СуммыПКО
	|		ПО ЗаданиеНаДоставкуДоставкаПоказная.Контрагент = СуммыПКО.ТекКонтрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресДоставки
	|		ПО ЗаданиеНаДоставкуДоставкаПоказная.Контрагент = АдресДоставки.Объект
	|			И (АдресДоставки.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (АдресДоставки.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ТелефонКонтрагента
	|		ПО ЗаданиеНаДоставкуДоставкаПоказная.Контрагент = ТелефонКонтрагента.Объект
	|			И (ТелефонКонтрагента.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|			И (ТелефонКонтрагента.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)),
	|	(ВЫБРАТЬ
	|		Константы.ОсновнаяОрганизация КАК ОсновнаяОрганизация
	|	ИЗ
	|		Константы КАК Константы) КАК КонстОснОрганизация
	|ГДЕ
	|	ЗаданиеНаДоставкуДоставкаПоказная.Ссылка = &Ссылка
	|	И ЗаданиеНаДоставкуДоставкаПоказная.Деньги
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТелефонКонтрагента.Объект ЕСТЬ NULL
	|				ТОГДА """"
	|			ИНАЧЕ ТелефонКонтрагента.Представление
	|		КОНЕЦ КАК СТРОКА(100)),
	|	ЗаданиеНаДоставкуДоставкаПоказная.Контрагент,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА АдресДоставки.Объект ЕСТЬ NULL
	|				ТОГДА """"
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПОДСТРОКА(АдресДоставки.Поле4, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле6, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле7, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	|						ТОГДА АдресДоставки.Представление
	|					ИНАЧЕ АдресДоставки.Поле4 + "" "" + АдресДоставки.Поле5 + "", "" + АдресДоставки.Поле6 + "", дом № "" + АдресДоставки.Поле7 + "" "" + ВЫБОР
	|							КОГДА ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	|								ТОГДА """"
	|							ИНАЧЕ "" корпус "" + АдресДоставки.Поле8
	|						КОНЕЦ + "" "" + ВЫБОР
	|							КОГДА ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	|								ТОГДА """"
	|							ИНАЧЕ "" оф."" + АдресДоставки.Поле9
	|						КОНЕЦ + """"
	|				КОНЕЦ
	|		КОНЕЦ КАК СТРОКА(999))
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(КоличествоМест),
	|	МАКСИМУМ(Возврат),
	|	МАКСИМУМ(Маршрут),
	|	МАКСИМУМ(ПриоритетВМаршруте),
	|	МИНИМУМ(НомерСтроки),
	|	МАКСИМУМ(СуммаПКО),
	|	МАКСИМУМ(СуммаПКОУпр),
	|	МАКСИМУМ(ДокументЧек),
	|	МАКСИМУМ(АдресДоставки),
	|	МАКСИМУМ(Тел)
	|ПО
	|	Грузополучатель
	|АВТОУПОРЯДОЧИВАНИЕ" ;
	
	Запрос.УстановитьПараметр("Ссылка",ДокСсылка);
	
	Пакет = Запрос.ВыполнитьПакет();
	ЗапросШапка = Пакет[2].Выгрузить();
	ЗК = Пакет[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПроверяемДоверенность = Константы.ИспользоватьДоверенностиКлиентов.Получить();
		
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаданиеНаДоставку_ОтчетОВыполнении";
	Макет = ПолучитьМакет("ОтчетОВыполнении");
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Основная");
	
	Шапка = ЗапросШапка[0];
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.Дата = Формат(Шапка.Дата,"ДЛФ=D");
	ТабДок.Вывести(ОбластьМакета); 

	Если ПроверяемДоверенность Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка|Доверенности");
		ТабДок.Присоединить(ОбластьМакета);
	КонецЕсли;			
	
	ТекНом = 0;
	
	ЗапросГП = Новый Запрос;
	ЗапросГП.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ГоловнойКонтрагент = &ГоловнойКонтрагент
	|	И Контрагенты.Ссылка <> &ГоловнойКонтрагент";
	
	//+Кабанов А.В. 21.04.2025 # UT10-5202
	ЗапросДолга = Новый Запрос;
	ЗапросДолга.Текст =
	"ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(, ДокументРасчетовСКонтрагентом = &Реализация) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток > 0";
	//-Кабанов А.В. 21.04.2025 # UT10-5202

	Пока ЗК.Следующий() Цикл
		
		ЗапросКонтрагенты = ЗК.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ЗапросКонтрагенты.Следующий() Цикл			
			
			ТекстВозврат = "";
			
			Если ЗК.Возврат = 1 Тогда 
				
				Если ЗапросКонтрагенты.Возврат = 1  Тогда 
					// не выводим строчку возврата
					Продолжить;
				Иначе
					ТекстВозврат = "Да";
					// но о том, что по конрагенту есть возврат, отметим
				КонецЕсли;
			КонецЕсли;
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка|Основная");
			ОбластьМакета.Параметры.Заполнить(ЗапросКонтрагенты);

			Если ЗапросКонтрагенты.АдресДоставки = "" Или ЗапросКонтрагенты.Тел = "" Тогда
				
				ЗапросГП.УстановитьПараметр("ГоловнойКонтрагент", ЗапросКонтрагенты.Грузополучатель);
				РезультатГП = ЗапросГП.Выполнить();
				
				Если НЕ РезультатГП.Пустой() Тогда
					
					ВыборкаГП = РезультатГП.Выбрать();
					ВыборкаГП.Следующий();
					
					Если ЗапросКонтрагенты.АдресДоставки = "" Тогда
						ОбластьМакета.Параметры.АдресДоставки = МСК.ПолучитьАдресДоставки(ВыборкаГП.Ссылка);
					КонецЕсли;
					
					Если ЗапросКонтрагенты.Тел = "" Тогда
						ОбластьМакета.Параметры.Тел = МСК.ПолучитьТелефоны(ВыборкаГП.Ссылка);
					КонецЕсли; 			
					
				КонецЕсли;			
				
			КонецЕсли;		
			
			ОбластьМакета.Параметры.Возврат = ТекстВозврат;
			
			ТекНом = ТекНом + 1;
			ОбластьМакета.Параметры.Сч = ТекНом;
			ПечСписокДокументов = "";
			ПечСуммаРеализации = 0;			
			ПечСтатусыДоставки = "";
			ПечВремяПередачи   = "";
			
			ПечОплатаНаличными = ?(ЗапросКонтрагенты.ПриемДенег, "Да", "");
			
			ЗапросДок = ЗапросКонтрагенты.Выбрать();
			
			Пока ЗапросДок.Следующий() Цикл
				
				ПечСписокДокументов = ПечСписокДокументов + ?(ЗначениеЗаполнено(ПечСписокДокументов), Символы.ПС, "") + СокрЛП(ЗапросДок.Номер);
				ПечСуммаРеализации  = ПечСуммаРеализации + ЗапросДок.СуммаРеализации; 
				ПечСтатусыДоставки  = ПечСтатусыДоставки + ?(ЗначениеЗаполнено(ПечСтатусыДоставки), Символы.ПС, "") + СокрЛП(ЗапросДок.СтатусДоставки);
				ПечВремяПередачи    = ПечВремяПередачи + ?(ЗначениеЗаполнено(ПечВремяПередачи), Символы.ПС, "") + СокрЛП(ЗапросДок.ВремяПередачи);
				
				Если ЗапросДок.ПриемДенег Тогда 
					ПечОплатаНаличными = "Да";
				КонецЕсли;	
						
			КонецЦикла;	
			
			ПечСписокДокументов	= ПечСписокДокументов + ?(ЗначениеЗаполнено(ПечСписокДокументов), "", СокрЛП(ЗапросКонтрагенты.Номер));
			ПечСуммаРеализации  = ?(ЗначениеЗаполнено(ПечСуммаРеализации), ПечСуммаРеализации, ЗапросКонтрагенты.СуммаРеализации); 
			ПечСтатусыДоставки	= ПечСтатусыДоставки + ?(ЗначениеЗаполнено(ПечСтатусыДоставки), "", СокрЛП(ЗапросКонтрагенты.СтатусДоставки));
			ПечВремяПередачи	= ПечВремяПередачи	+	?(ЗначениеЗаполнено(ПечВремяПередачи), "", СокрЛП(ЗапросКонтрагенты.ВремяПередачи));
			
			ОбластьМакета.Параметры.СуммаРеализации 	= Формат(ПечСуммаРеализации, "ЧЦ=15; ЧДЦ=2"); 
			ОбластьМакета.Параметры.СписокДокументов 	= ПечСписокДокументов;
			ОбластьМакета.Параметры.ПриемДенег		 	= ПечОплатаНаличными;
			ОбластьМакета.Параметры.СтатусДоставки	 	= ПечСтатусыДоставки;
			ОбластьМакета.Параметры.ВремяПередачи	 	= ПечВремяПередачи;
			
			Если ЗапросКонтрагенты.ДокументЧек <> NULL Тогда 				
				
				ОбластьМакета.Параметры.ПКО = ЗапросКонтрагенты.ДокументЧек.Номер;
				ОбластьМакета.Параметры.ПКОСсылка = ЗапросКонтрагенты.ДокументЧек;
				
			КонецЕсли;    		
			
			//+Кабанов А.В. 21.04.2025 # UT10-5202
			Если ЗапросКонтрагенты.ПриемДенег И ЗапросКонтрагенты.СтатусДоставки = Перечисления.СтатусыДоставки.ТоварПередан Тогда 
				
				ЗапросДолга.УстановитьПараметр("Реализация",ЗапросКонтрагенты.Ссылка);
				РезультатЗапросаДолга = ЗапросДолга.Выполнить();
				
				Если НЕ РезультатЗапросаДолга.Пустой() Тогда
					ОбластьМакета.Параметры.ФактОплаты = "ДОЛГ";	
				Иначе
					ОбластьМакета.Параметры.ФактОплаты = "оплачен";	
				КонецЕсли;
				
			КонецЕсли;			
			//-Кабанов А.В. 21.04.2025 # UT10-5202


			ТабДок.Вывести(ОбластьМакета);

			Если ПроверяемДоверенность Тогда
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка|Доверенности");
				ОбластьМакета.Параметры.Доверенность = ЗапросКонтрагенты.Доверенность;
				ТабДок.Присоединить(ОбластьМакета);
				
			КонецЕсли;			

		КонецЦикла;
		
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтог|Основная");
	ОбластьМакета.Параметры.СуммаПКО = Шапка.СуммаПКО;
	ОбластьМакета.Параметры.СуммаПКОУпр = Шапка.СуммаПКОУпр; 
	ОбластьМакета.Параметры.СуммаПКОВсего = Шапка.СуммаПКО + Шапка.СуммаПКОУпр; 
	
	ТабДок.Вывести(ОбластьМакета);
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДок, 1, Ложь, "Отчет о выполнении документа" + ДокСсылка.Метаданные().Представление(), ДокСсылка);
	
КонецПроцедуры

Функция ПолучитьНомерWMSДляГМ(ГрузовоеМесто) Экспорт

	//+Шульман А. 21.02.2025 #UT10-5103 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГрузовоеМесто.Сборка КАК Сборка
	|ПОМЕСТИТЬ ВТ_ГрузовоеМесто
	|ИЗ
	|	Документ.ГрузовоеМесто КАК ГрузовоеМесто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ГрузовоеМесто.Товары КАК ГрузовоеМестоТовары
	|		ПО ГрузовоеМесто.Ссылка = ГрузовоеМестоТовары.Ссылка
	|			И (ГрузовоеМесто.Ссылка = &ГрузовоеМесто)
	|			И (ГрузовоеМестоТовары.Заказ.ВидПроцесса В (ЗНАЧЕНИЕ(Перечисление.ВидыПроцессов.ВозвратНеликвидаТОХчерезWMS), ЗНАЧЕНИЕ(Перечисление.ВидыПроцессов.ВозвратНеликвидаТОХНапрямуюПоставщику)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаданиеНаДоставкуДоставка.Ссылка.НомерWMS
	|ИЗ
	|	ВТ_ГрузовоеМесто КАК ВТ_ГрузовоеМесто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
	|		ПО ВТ_ГрузовоеМесто.Сборка = ЗаданиеНаДоставкуДоставка.ДокументСборки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаданиеНаДоставкуВозвраты.Ссылка.НомерWMS
	|ИЗ
	|	ВТ_ГрузовоеМесто КАК ВТ_ГрузовоеМесто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаДоставку.Возвраты КАК ЗаданиеНаДоставкуВозвраты
	|		ПО ВТ_ГрузовоеМесто.Сборка = ЗаданиеНаДоставкуВозвраты.ДокументСборки";
	
	Запрос.УстановитьПараметр("ГрузовоеМесто", ГрузовоеМесто);
	
	РезультатЗапроса = Запрос.Выполнить();     
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();    
	Возврат Выборка.НомерWMS;
	//-Шульман А. 21.02.2025 #UT10-5103 

КонецФункции // ()  

Функция ПолучитьТаблицуМаршрутаДляОтправкиВЭДО(ЗаданиеНаДоставку = Неопределено, МассивСборок = Неопределено) Экспорт 
	//+Белов А. 25.08.2026 #UT10-6004
		
    Запрос = Новый Запрос;
		
	Если ЗаданиеНаДоставку <> Неопределено Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаДоставкуДоставка.Контрагент
		|ИЗ
		|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
		|ГДЕ
		|	ЗаданиеНаДоставкуДоставка.ДокументСборки ССЫЛКА Документ.СборкаЗаказовПокупателя
		|	И ЗаданиеНаДоставкуДоставка.Ссылка = &Ссылка
		|	И ВЫРАЗИТЬ(ЗаданиеНаДоставкуДоставка.ДокументСборки КАК Документ.СборкаЗаказовПокупателя).Договор.ОтправлятьЭТРН";
		
		Запрос.УстановитьПараметр("Ссылка", ЗаданиеНаДоставку);  
		
	Иначе  
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СборкаЗаказовПокупателя.Контрагент
		|ИЗ
		|	Документ.СборкаЗаказовПокупателя КАК СборкаЗаказовПокупателя
		|ГДЕ
		|	СборкаЗаказовПокупателя.Ссылка В(&МассивСборок)
		|	И СборкаЗаказовПокупателя.Договор.ОтправлятьЭТРН";
		
		Запрос.УстановитьПараметр("МассивСборок", МассивСборок);  
		
	КонецЕсли;
		
	Рез = Запрос.Выполнить().Выгрузить();   
	
	Возврат Рез;
	
	//-Белов А. 25.08.2026 #UT10-6004
КонецФункции 

Функция ПолучитьЗаказЗаявку(ЗаданиеНаДоставку) Экспорт 
//+Белов А. 25.08.2026 #UT10-6004

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказЗаявка.Ссылка
	|ИЗ
	|	Документ.ЗаказЗаявка КАК ЗаказЗаявка
	|ГДЕ
	|	ЗаказЗаявка.ЗаданиеНаДоставку = &Ссылка
	|	И НЕ ЗаказЗаявка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаданиеНаДоставку);  
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
//-Белов А. 25.08.2026 #UT10-6004
КонецФункции

Функция ПолучитьМассивРеализацийДляОтправкиВЭДО(ЗаданиеНаДоставку) Экспорт
//+Белов А. 25.08.2026 #UT10-6004

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданиеНаДоставкуДоставка.ДокументСборки КАК Сборка
	|ПОМЕСТИТЬ ВТ_Сборки
	|ИЗ
	|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
	|ГДЕ
	|	ЗаданиеНаДоставкуДоставка.Ссылка = &ЗаданиеНаДоставку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
	|ГДЕ
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки В
	|			(ВЫБРАТЬ
	|				ВТ_Сборки.Сборка
	|			ИЗ
	|				ВТ_Сборки)
	|	И НЕ РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.ПометкаУдаления
	|	И РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.ДоговорКонтрагента.ОтправлятьЭТРН";
	
	Запрос.УстановитьПараметр("ЗаданиеНаДоставку", ЗаданиеНаДоставку);  
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Возврат Рез.ВыгрузитьКолонку("Ссылка");
	
//-Белов А. 25.08.2026 #UT10-6004
КонецФункции
